import "./Heading.css"

const Heading = () => {

    return (
        <div className="heading">
            <div className="heading__text">
            Наш фотоцентр предлагает удобный сервис заказа печати фотографий через интернет и доставку курьерами по России.<br />
            Мы всегда заботимся о наших клиентах, привлекая их качеством предоставленных услуг, стандартом обслуживания, а также значительным количеством предоставляемых фотоуслуг.<br />
            Для заказа фотопечати через интернет вы можете оформить печать фотографий онлайн прямо со своего устройства.
            </div>
        </div>
    )
}

export default Heading;