import "./Principials.css";
import { Row, Col } from "antd";

const Principials = () => {
    return (
        <>
            <h1 className="block-title"  id="principials">
                Наши принципы
            </h1>
            <Row>
                <Col md={8} className="principial">
                    <svg xmlns="http://www.w3.org/2000/svg" width="100" viewBox="0 0 70 70">
                        <path fill="#727272" d="M29.9 19.4c-.3-.2-.7-.3-1-.1-.3.2-.5.5-.5.9v15c0 .4.2.7.6.9.4.1.8 0 1-.3l2.4-2.9 3.2 6.6c.2.5.8.7 1.2.4l2.6-1.2c.2-.1.4-.3.5-.5.1-.2.1-.5 0-.7l-3.2-6.6h4.1c.4 0 .7-.2.9-.6.1-.4 0-.8-.3-1l-11.5-9.9zm5.3 9.6c-.3 0-.6.2-.8.4-.2.3-.2.6-.1.9l3.4 7-.9.4-3.4-7.1c-.1-.3-.4-.5-.7-.5-.3 0-.6.1-.8.3l-1.6 2V22.1l8 6.9h-3.1z"></path>
                        <path fill="#727272" d="M61.3 8H8.7C6.1 8 4 10.1 4 12.7v35.6C4 50.9 6.1 53 8.7 53h25.4v7.1H23c-.5 0-.9.4-.9.9s.4.9.9.9h24c.5 0 .9-.4.9-.9s-.4-.9-.9-.9H36V53h25.4c2.6 0 4.7-2.1 4.7-4.7V12.7C66 10.1 63.9 8 61.3 8zm2.8 40.3c0 1.6-1.3 2.8-2.8 2.8H8.7c-1.6 0-2.8-1.3-2.8-2.8V12.7c0-1.6 1.3-2.8 2.8-2.8h52.6c1.6 0 2.8 1.3 2.8 2.8v35.6z"></path>
                    </svg>
                    <h2><b>Удобство</b></h2>
                    <div className="principial__caption">Оставьте заявку через интернет и наш сотрудник свяжется с вами, чтобы обсудить детали заказа. После чего вы можете прийти в фотоцентр в назначенный срок и сразу забрать заказ.</div>
                </Col>
                <Col md={8} className="principial">
                    <svg xmlns="http://www.w3.org/2000/svg" width="100" viewBox="0 0 70 70">
                        <path fill="#727272" d="M35.3 60.9c.1 0 .1 0 0 0 .1 0 .1 0 0 0zm-.7 0c.1 0 .1 0 0 0zm.4.1zm31-36.2s0-.1 0 0c0-.2 0-.2-.1-.3 0 0 0-.1-.1-.1 0 0 0-.1-.1-.1L54.5 9.4l-.3-.3c-.1-.1-.3-.1-.4-.1H16.2c-.1 0-.3 0-.4.1l-.3.3L4.2 24.2s0 .1-.1.1c0 0 0 .1-.1.1 0 .1 0 .2-.1.3v.1c0 .1 0 .2.1.3 0 0 0 .1.1.1 0 .1.1.1.1.2l30.1 35.3v-.1c0-.1-.1-.1-.1-.2v-.1l-1.4-4.4L7 25.7h16l-.2-.6v-.7c0-.1 0-.1.1-.2v-.1l.9-1.2-6.2-12.2H33l1.1-1.5.1-.1.1-.1c.1 0 .1-.1.2-.1s.1 0 .2-.1h.4c.1 0 .1 0 .2.1.1 0 .1 0 .2.1l.1.1.1.1 1.1 1.5h15.4L46.1 23l.9 1.2v.1c0 .1.1.1.1.2v.7l-.1.5h16L37.3 55.9l-1.4 4.4v.1c0 .1-.1.1-.1.2v.1l30.1-35.3c0-.1.1-.1.1-.2 0 0 0-.1.1-.1-.1-.1-.1-.2-.1-.3zm-59.2-.9L16 11.7l6.2 12.2H6.8zm47.1-12.2l9.2 12.2H47.8l6.1-12.2z"></path>
                        <path fill="#727272" d="M35.9 60.4l1.5-4.5L47 25.7l.2-.6v-.7c0-.1 0-.1-.1-.2v-.1l-1-1.1-9.2-12.2-1.1-1.5-.1-.1-.1-.1c-.1 0-.1-.1-.2-.1s-.1 0-.2-.1h-.4c-.1 0-.1 0-.2.1-.1 0-.1 0-.2.1l-.1.1-.1.1-1.1 1.5L23.9 23l-.9 1.2v.1c0 .1-.1.1-.1.2v.7l.2.6L32.7 56l1.4 4.4v.1c0 .1.1.1.1.2v.1l.1.1.1.1.1.1h.8s.1 0 .1-.1l.1-.1.1-.1v-.1l.3-.3zM45 25.7L35 57 25 25.7h20zm-19.4-1.8L35 11.5l9.4 12.4H25.6z"></path>
                    </svg>
                    <h2><b>Качество</b></h2>
                    <div className="principial__caption">Собственное производство фотосувениров и фотокниг. Печать фото в настоящей фотолаборатории.</div>
                </Col>
                <Col md={8} className="principial">
                    <svg xmlns="http://www.w3.org/2000/svg" width="100" viewBox="0 0 70 70">
                        <path fill="#727272" d="M48.9 34.8c0-.5-.4-.9-.9-.9H32.5V19.3c0-.5-.4-.9-.9-.9s-.9.4-.9.9v15.6c0 .3.1.5.3.7.2.2.4.3.7.3h16.4c.4-.1.8-.6.8-1.1z"></path>
                        <path fill="#727272" d="M67.6 24.2c-.4-.3-1-.2-1.3.3l-5.2 7.7C59.7 16.9 47 5 31.6 5 15.3 5 2 18.5 2 35s13.3 30 29.6 30c9.9 0 19-4.9 24.6-13.2.3-.4.2-1-.3-1.3-.4-.3-1-.2-1.3.3-5.2 7.8-13.8 12.4-23 12.4C16.3 63.1 3.9 50.5 3.9 35S16.4 6.9 31.7 6.9c14.7 0 26.8 11.6 27.7 26.3L51 27.4c-.4-.3-1-.2-1.3.3-.3.4-.2 1 .2 1.3l9.9 6.8h.1c.1 0 .1.1.2.1h.6c.1 0 .1 0 .2-.1.1 0 .1-.1.1-.1l.1-.1.1-.1 6.7-10c.2-.4.1-1-.3-1.3z"></path>
                        <ellipse fill="#727272" cx="31.6" cy="11.7" rx=".9" ry=".9"></ellipse>
                        <ellipse fill="#727272" cx="8.6" cy="34.9" rx=".9" ry=".9"></ellipse>
                        <ellipse fill="#727272" cx="31.7" cy="58.3" rx=".9" ry=".9"></ellipse>
                    </svg>
                    <h2><b>Оперативность</b></h2>
                    <div className="principial__caption">Заказы выполняются точно в оговоренный с Вами срок.</div>
                </Col>
            </Row>
        </>
    )
}

export default Principials;
